#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan (dev) 📖`success`

<details><summary>Show Plan</summary>

```

aws_acm_certificate.app_certificate[0]: Refreshing state... [id=arn:aws:acm:us-east-1:437707960179:certificate/2db870b6-ef7f-4590-9e51-9f2305ee92ab]
aws_cloudfront_origin_access_control.app_oac: Refreshing state... [id=E2D87NNSQM3OC1]
data.aws_route53_zone.main_domain[0]: Reading...
aws_cloudfront_origin_request_policy.app_request_policy: Refreshing state... [id=a8acaa09-2576-413e-98f4-1c964889d90b]
aws_s3_bucket.app_bucket: Refreshing state... [id=dev-nextjs-formation-app-bucket]
aws_cloudfront_cache_policy.app_cache_policy: Refreshing state... [id=1c0867cb-23b8-4b74-8b85-cfe4245cb927]
data.aws_route53_zone.main_domain[0]: Read complete after 1s [id=Z0901806342JE97O6SZMG]
aws_route53_record.cert_validation["dev-nextjs.stansk.com"]: Refreshing state... [id=Z0901806342JE97O6SZMG__ff51aa8190939b9276286b50e23a6709.dev-nextjs.stansk.com._CNAME]
aws_acm_certificate_validation.cert_validation[0]: Refreshing state... [id=2025-03-31 16:25:48.663 +0000 UTC]
aws_s3_bucket_policy.app_bucket_policy: Refreshing state... [id=dev-nextjs-formation-app-bucket]
aws_s3_bucket_versioning.app_bucket_versioning: Refreshing state... [id=dev-nextjs-formation-app-bucket]
aws_s3_bucket_website_configuration.app_website: Refreshing state... [id=dev-nextjs-formation-app-bucket]
aws_cloudfront_distribution.app_distribution: Refreshing state... [id=EUFDQB1541JUG]
aws_route53_record.app_domain[0]: Refreshing state... [id=Z0901806342JE97O6SZMG_dev-nextjs.stansk.com_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudfront_distribution.app_distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "app_distribution" {
        id                             = "EUFDQB1541JUG"
        tags                           = {
            "Environment" = "dev"
            "Name"        = "dev-nextjs-formation-distribution"
        }
        # (21 unchanged attributes hidden)

      - origin {
          - connection_attempts      = 3 -> null
          - connection_timeout       = 10 -> null
          - domain_name              = "dev-nextjs-formation-app-bucket.s3.eu-west-1.amazonaws.com" -> null
          - origin_access_control_id = "E2D87NNSQM3OC1" -> null
          - origin_id                = "S3-dev-nextjs-formation" -> null
        }
      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = (known after apply)
          + origin_id           = "S3-dev-nextjs-formation"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "http-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }
        }

        # (5 unchanged blocks hidden)
    }

  # aws_cloudfront_origin_access_control.app_oac will be destroyed
  # (because aws_cloudfront_origin_access_control.app_oac is not in configuration)
  - resource "aws_cloudfront_origin_access_control" "app_oac" {
      - arn                               = "arn:aws:cloudfront::437707960179:origin-access-control/E2D87NNSQM3OC1" -> null
      - description                       = "OAC pour l'accès au bucket S3" -> null
      - etag                              = "ETVPDKIKX0DER" -> null
      - id                                = "E2D87NNSQM3OC1" -> null
      - name                              = "dev-nextjs-formation-oac" -> null
      - origin_access_control_origin_type = "s3" -> null
      - signing_behavior                  = "always" -> null
      - signing_protocol                  = "sigv4" -> null
    }

  # aws_s3_bucket_policy.app_bucket_policy will be updated in-place
  ~ resource "aws_s3_bucket_policy" "app_bucket_policy" {
        id     = "dev-nextjs-formation-app-bucket"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          + IpAddress    = {
                              + "aws:SourceIp" = []
                            }
                          - StringEquals = {
                              - "AWS:SourceArn" = "arn:aws:cloudfront::437707960179:distribution/EUFDQB1541JUG"
                            }
                        }
                      ~ Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        } -> "*"
                      ~ Sid       = "AllowCloudFrontServicePrincipal" -> "PublicReadGetObject"
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # aws_s3_bucket_website_configuration.app_website is tainted, so must be replaced
-/+ resource "aws_s3_bucket_website_configuration" "app_website" {
      ~ id               = "dev-nextjs-formation-app-bucket" -> (known after apply)
      + routing_rules    = (known after apply)
      ~ website_domain   = "s3-website-eu-west-1.amazonaws.com" -> (known after apply)
      ~ website_endpoint = "dev-nextjs-formation-app-bucket.s3-website-eu-west-1.amazonaws.com" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ error_document {
          ~ key = "404.html" -> "index.html"
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
